In [15]:
#libraries
import pandas as pd
import numpy as np

In [5]:
#read in dataframe
df = pd.read_csv('./datasets/world_ind_pop_data.csv')

In [10]:
#create dataframe from dictionary
data = {'weekday':['Sun','Sun','Mon'],'city':['Austin','Dallas','Austin'],'visitors':[139,237,326]}
df2=pd.DataFrame(data)
df2.head()

  weekday    city  visitors
0     Sun  Austin       139
1     Sun  Dallas       237
2     Mon  Austin       326

In [13]:
#create datafram from lists
weekday=['Sun','Sun','Mon']
city=['Austin','Dallas','Austin']
visitors=[139,237,326]
list_labels=['weekday','city','visitors']
list_cols=[weekday,city,visitors]
zipped = list(zip(list_labels,list_cols))
data = dict(zipped)
df3=pd.DataFrame(data)
df3.head()

  weekday    city  visitors
0     Sun  Austin       139
1     Sun  Dallas       237
2     Mon  Austin       326

In [17]:
#create dataframe from list and broadcast
heights=[59,65,62,65]
data={'heights':heights,'sex':'M'}
df4=pd.DataFrame(data)
df4.tail()

   heights sex
0       59   M
1       65   M
2       62   M
3       65   M

In [ ]:
#inspection
type(df)
df.shape
df.columns
type(df.columns)
df.index
df.head(5)
df.tail()
df.info()

In [ ]:
#slicing
df.iloc[:5,:]
df.iloc[-5:,:]
df.loc #with labels

In [16]:
#assigning values
df2.iloc[::3,-1]=np.nan
print(df2.head())
df3['fees']=0
print(df3.head())

  weekday    city  visitors
0     Sun  Austin       NaN
1     Sun  Dallas     237.0
2     Mon  Austin     326.0
  weekday    city  visitors  fees
0     Sun  Austin       139     0
1     Sun  Dallas       237     0
2     Mon  Austin       326     0

In [ ]:
#extract column
low = df['low']
type(low)
lows = low.values